// SPDX-License-Identifier: GPL-3.0-only
// Copyright (C) 2026 whekkees (Daniil)


use crate::drivers::io::outb::outb;
pub const PIT_FREQUENCY: u32 = 1_193_180;

pub unsafe fn set_channel_2(frequency: u32) {
    let divisor = PIT_FREQUENCY / frequency;

    outb(0x43, 0xB6);

    outb(0x42, divisor as u8);
    outb(0x42, (divisor >> 8) as u8);
}


/*



0x42 — это 8-битный I/O-порт, через который мы взаимодействуем с Channel 2.
0x43 - это 8 битный i o порт с помощью которого мы выбираем сектор режим доступ

младшие биты - это биты которые находятся справа
старшие биты - это те биты которые находятся слева
называеются они так потому что мы имеем например 128 64 32 16 8 4 2 1 и слева логично старшие биты потому что большие а справа младшие потому что меньше 
PIT - Это таймер специальный в компьютере 
чтобы получить эти биты нам наужно например когда мы вызываем set_channel_2(440); мы делим 1_193_180 Базовую частоту звука pit на частоту указанную тобой и,
дальше мы полученное число например 2711 и делим его на 2 до тех пор пока результат деления не станет 0 ( ставим 1 на нечетных числах а 0 на четных ) в итоге у нас вышло 101010010111,
разбираем по 4 1010 1001 0111 получается 12 битов а нужно 16 потому что PIT использует только 16 битное значение делителя как я выше уже говорил поэтому нужно добавть 4 нуля и выходит 00001010 10010111 и тут мы получаем уже,
младшие и старшие биты 
 */