// SPDX-License-Identifier: GPL-3.0-only
// Copyright (C) 2026 whekkees (Daniil)

use crate::drivers::io::outb::outb;
use crate::drivers::io::inb::inb;
use super::pit;

pub unsafe fn play_sound(frequency: u32) {
    pit::set_channel_2(frequency);

    let tmp = inb(0x61); 

    if tmp & 0b00000011 != 0b00000011 {
        outb(0x61, tmp | 0b00000011);
    }
}



/*
мы создаем ансейв функцию play_sound с  переменной frequency с u32 
дальше мы подключаем channel 2 с помощью pit.rs
после этого мы создаем переменную которая проверяет порт на состояние 
дальше мы проверяем биты tmp (точнее 8битов потому что tmp у нас весит 1 байт а,
в 1 байте ровно 8 битов и все эти биты нужно проверить на 2 наших нужных ) на 0b00000011,
( тоесть 2 бита ) я написал специально вместо 3 0b00000011 чтобы тому кто это читал,
 не приходилось для понятия переводить десятичные в бинарные,
 после чего мы сравниваем полученные биты с теми же двумя и укзавыаем что если полученные биты не сходятся с теми двумя
 то мы записываем эти 2 бита в порт 0x61 


 после чего мы создаем функцию stop_sound в которой мы создаем переменную tmp 
 которая читает порт 0x61 и сравнивает его с байтом 0xFC
 дальше просто записываем в порт тот байт 
 */