use super::io::outb::outb;

pub const PIT_FREQUENCY: u32 = 1_193_180;

pub unsafe fn set_channel_2(frequency: u32) {
    let divisor = PIT_FREQUENCY / frequency;

    outb(0x43, 0xB6);

    outb(0x42, divisor as u8);
    outb(0x42, (divisor >> 8) as u8);
}


/*
сначала мы создаем публичную 32 битную константу под названием PIT_FREQURENCY которая будет хранить базовую частоту PIT
после чего мы создаем ансейв функцию set_channel_2 что в переводе значит установить 2 канал
после чего мы создаем переменную divisor что в переводе делитель и там делим базовую частоту воспроизведения звука pit на переменную  frequrency что в переводе частота
и после этого мы записываем в порт 0x43 байт oxb6
после чего мы отправляем в порт 0x42 ( pit channel 2 ) 32 битный divisor что в переводе частота по 8 младших бит потому что PIT использует только 16 битное значение делителя,
и так же  наш outb записывает только по 1байту а 16 бит это 2 байта





младшие биты - это биты которые находятся справа
старшие биты - это те биты которые находятся слева

чтобы получить эти биты нам наужно например когда мы вызываем set_channel_2(440); мы делим 1_193_180 Базовую частоту звука pit на частоту указанную тобой и,
дальше мы полученное число например 2711 представляем в двоичном типе
 */