
use core::arch::asm;


pub unsafe fn inb(port: u16) -> u8 { 
    let value : u8;
    asm!(
        "in al, dx",
        in("dx") port,
        out("al") value,

        options(nostack, preserves_flags),
    );

    value;
}

/*
мы создаем функицю которая будет возвращать 1 байт чтобы знать значение которое мы записали с помощью outb
потом после чего мы читаем 1 байт портового регистра dx в al потому что мы так передаем состояние порта и возвращаем value чтобы сохранить состояние того же порта
дальше мы читаем порт из port и кладем его в портовый регистр dx 
дальше мы записываем 1 байт в value чтобы сохранить состояние порта
 */